// 日升集团-MRB评审流程   当流程是东方日升（安徽）新能源有限公司计划仓储部申请时，不合格分类显示1、2、3下拉框。如时安徽公司其它部门选择时，不合格分类显示1、3

// 申请部门
// 字段ID : field10915
// 数据库字段名称 : SQBM

// 不合格分类
// 字段ID : field15771
// 数据库字段名称 : YCL

const SQBM = "field10915";
const YCL = "field15771";
const SQBMV = WfForm.getFieldValue(SQBM);
//1211 东方日升（安徽）新能源有限公司 的 计划仓储部 
// departmentIds 是东方日升（安徽）新能源有限公司 的其他下级不萌
//427 为我的部门ID最为测试
departmentIds = ["1391", "1389", "1301", "1277", "1276", "1275", "1274", "1268", 
"1213", "1212", "1210", "1209", "1208", "1207", "1206", "1205", "1204", "1203", 
"1202", "1201", "1200", "1199", "1198", "1197", "1196", "1195", "1194", "1193", 
"1192", "1191", "1190", "1189", "1188", "1187", "1186", "1185", "1166", "1137", 
"1063", "1062", "1061", "1060", "1059", "1058"]
departmentIds.push("427");
if (departmentIds.includes(SQBMV)) {
    $("[title^=紧急放行]")[0].style.cssText="display:none"
}
